[
    {},
    {
        "book_name": "People We Meet on Vacation",
        "url": "https://www.goodreads.com/book/show/54985743-people-we-meet-on-vacation",
        "author": "Emily Henry",
        "ratings": {
            "ratings_score": 4.11,
            "rating_count": 216194.0
        },
        "description": "Poppy and Alex. Alex and Poppy. They have nothing in common. She’s a wild child; he wears khakis. She has insatiable wanderlust; he prefers to stay home with a book. And somehow, ever since a fateful car share home from college many years ago, they are the very best of friends. For most of the year thePoppy and Alex. Alex and Poppy. They have nothing in common. She’s a wild child; he wears khakis. She has insatiable wanderlust; he prefers to stay home with a book. And somehow, ever since a fateful car share home from college many years ago, they are the very best of friends. For most of the year they live far apart—she’s in New York City, and he’s in their small hometown—but every summer, for a decade, they have taken one glorious week of vacation together. Until two years ago, when they ruined everything. They haven’t spoken since. Poppy has everything she should want, but she’s stuck in a rut. When someone asks when she was last truly happy, she knows, without a doubt, it was on that ill-fated, final trip with Alex. And so, she decides to convince her best friend to take one more vacation together—lay everything on the table, make it all right. Miraculously, he agrees. Now she has a week to fix everything. If only she can get around the one big truth that has always stood quietly in the middle of their seemingly perfect relationship. What could possibly go wrong?"
    },
    {
        "book_name": "Klara and the Sun",
        "url": "https://www.goodreads.com/book/show/54120408-klara-and-the-sun",
        "author": "Kazuo Ishiguro",
        "ratings": {
            "ratings_score": 3.81,
            "rating_count": 103187.0
        },
        "description": "From the best-selling author of  and , a stunning new novel—his first since winning the Nobel Prize in Literature—about the wondrous, mysterious nature of the human heart.From her place in the store, Klara, an Artificial Friend with outstanding observational qualities, watches carefully the behavior of those who come in to browse, and oFrom the best-selling author of  and , a stunning new novel—his first since winning the Nobel Prize in Literature—about the wondrous, mysterious nature of the human heart.From her place in the store, Klara, an Artificial Friend with outstanding observational qualities, watches carefully the behavior of those who come in to browse, and of those who pass on the street outside. She remains hopeful that a customer will soon choose her, but when the possibility emerges that her circumstances may change forever, Klara is warned not to invest too much in the promises of humans.In , Kazuo Ishiguro looks at our rapidly changing modern world through the eyes of an unforgettable narrator to explore a fundamental question: what does it mean to love?"
    },
    {
        "book_name": "The Lost Apothecary",
        "url": "https://www.goodreads.com/book/show/53288434-the-lost-apothecary",
        "author": "Sarah Penner",
        "ratings": {
            "ratings_score": 3.78,
            "rating_count": 119713.0
        },
        "description": "A female apothecary secretly dispenses poisons to liberate women from the men who have wronged them—setting three lives across centuries on a dangerous collision course.Rule #1: The poison must never be used to harm another woman.Rule #2: The names of the murderer and her victim must be recorded in the apothecary’s register.One cold February evening in 1791, at the back ofA female apothecary secretly dispenses poisons to liberate women from the men who have wronged them—setting three lives across centuries on a dangerous collision course.Rule #1: The poison must never be used to harm another woman.Rule #2: The names of the murderer and her victim must be recorded in the apothecary’s register.One cold February evening in 1791, at the back of a dark London alley in a hidden apothecary shop, Nella awaits her newest customer. Once a respected healer, Nella now uses her knowledge for a darker purpose—selling well-disguised poisons to desperate women who would kill to be free of the men in their lives. But when her new patron turns out to be a precocious twelve-year-old named Eliza Fanning, an unexpected friendship sets in motion a string of events that jeopardizes Nella’s world and threatens to expose the many women whose names are written in her register.In present-day London, aspiring historian Caroline Parcewell spends her tenth wedding anniversary alone, reeling from the discovery of her husband’s infidelity. When she finds an old apothecary vial near the river Thames, she can’t resist investigating, only to realize she’s found a link to the unsolved “apothecary murders” that haunted London over two centuries ago. As she deepens her search, Caroline’s life collides with Nella’s and Eliza’s in a stunning twist of fate—and not everyone will survive."
    },
    {
        "book_name": "The Maidens",
        "url": "https://www.goodreads.com/book/show/45300567-the-maidens",
        "author": "Alex Michaelides",
        "ratings": {
            "ratings_score": 3.65,
            "rating_count": 91437.0
        },
        "description": "Edward Fosca is a murderer. Of this Mariana is certain. But Fosca is untouchable. A handsome and charismatic Greek Tragedy professor at Cambridge University, Fosca is adored by staff and students alike—particularly by the members of a secret society of female students known as The Maidens. Mariana Andros is a brilliant but troubled group therapist who becomes fixated on ThEdward Fosca is a murderer. Of this Mariana is certain. But Fosca is untouchable. A handsome and charismatic Greek Tragedy professor at Cambridge University, Fosca is adored by staff and students alike—particularly by the members of a secret society of female students known as The Maidens. Mariana Andros is a brilliant but troubled group therapist who becomes fixated on The Maidens when one member, a friend of Mariana’s niece Zoe, is found murdered in Cambridge. Mariana, who was once herself a student at the university, quickly suspects that behind the idyllic beauty of the spires and turrets, and beneath the ancient traditions, lies something sinister. And she becomes convinced that, despite his alibi, Edward Fosca is guilty of the murder. But why would the professor target one of his students? And why does he keep returning to the rites of Persephone, the maiden, and her journey to the underworld?When another body is found, Mariana’s obsession with proving Fosca’s guilt spirals out of control, threatening to destroy her credibility as well as her closest relationships. But Mariana is determined to stop this killer, even if it costs her everything—including her own life."
    },
    {
        "book_name": "A ​Court of Silver Flames",
        "url": "https://www.goodreads.com/book/show/53138095-a-court-of-silver-flames",
        "author": "Sarah J. Maas",
        "ratings": {
            "ratings_score": 4.39,
            "rating_count": 189261.0
        },
        "description": "Nesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it.The one person who ignNesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it.The one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites. The fire between them is undeniable, and only burns hotter as they are forced into close quarters with each other.Meanwhile, the treacherous human queens who returned to the Continent during the last war have forged a dangerous new alliance, threatening the fragile peace that has settled over the realms. And the key to halting them might very well rely on Cassian and Nesta facing their haunting pasts.Against the sweeping backdrop of a world seared by war and plagued with uncertainty, Nesta and Cassian battle monsters from within and without as they search for acceptance-and healing-in each other's arms."
    },
    {
        "book_name": "One Last Stop",
        "url": "https://www.goodreads.com/book/show/54860443-one-last-stop",
        "author": "Casey McQuiston",
        "ratings": {
            "ratings_score": 4.14,
            "rating_count": 67659.0
        },
        "description": "For cynical twenty-three-year-old August, moving to New York City is supposed to prove her right: that things like magic and cinematic love stories don’t exist, and the only smart way to go through life is alone. She can’t imagine how wFor cynical twenty-three-year-old August, moving to New York City is supposed to prove her right: that things like magic and cinematic love stories don’t exist, and the only smart way to go through life is alone. She can’t imagine how waiting tables at a 24-hour pancake diner and moving in with too many weird roommates could possibly change that. And there’s certainly no chance of her subway commute being anything more than a daily trudge through boredom and electrical failures.But then, there’s this gorgeous girl on the train.Jane. Dazzling, charming, mysterious, impossible Jane. Jane with her rough edges and swoopy hair and soft smile, showing up in a leather jacket to save August’s day when she needed it most. August’s subway crush becomes the best part of her day, but pretty soon, she discovers there’s one big problem: Jane doesn’t just look like an old school punk rocker. She’s literally displaced in time from the 1970s, and August is going to have to use everything she tried to leave in her own past to help her. Maybe it’s time to start believing in some things, after all.Casey McQuiston’s  is a magical, sexy, big-hearted romance where the impossible becomes possible as August does everything in her power to save the girl lost in time."
    },
    {
        "book_name": "Beautiful World, Where Are You",
        "url": "https://www.goodreads.com/book/show/56597885-beautiful-world-where-are-you",
        "author": "Sally Rooney",
        "ratings": {
            "ratings_score": 3.85,
            "rating_count": 52023.0
        },
        "description": "Alice, a novelist, meets Felix, who works in a warehouse, and asks him if he’d like to travel to Rome with her. In Dublin, her best friend, Eileen, is getting over a break-up and slips back into flirting with Simon, a man she has known sinceAlice, a novelist, meets Felix, who works in a warehouse, and asks him if he’d like to travel to Rome with her. In Dublin, her best friend, Eileen, is getting over a break-up and slips back into flirting with Simon, a man she has known since childhood. Alice, Felix, Eileen, and Simon are still young—but life is catching up with them. They desire each other, they delude each other, they get together, they break apart. They have sex, they worry about sex, they worry about their friendships and the world they live in. Are they standing in the last lighted room before the darkness, bearing witness to something? Will they find a way to believe in a beautiful world?"
    },
    {
        "book_name": "The Wife Upstairs",
        "url": "https://www.goodreads.com/book/show/53137893-the-wife-upstairs",
        "author": "Rachel Hawkins",
        "ratings": {
            "ratings_score": 3.77,
            "rating_count": 91832.0
        },
        "description": "Meet Jane. Newly arrived to Birmingham, Alabama, Jane is a broke dog-walker in Thornfield Estates––a gated community full of McMansions, shiny SUVs, and bored housewives. The kind of place where no one will notice if Jane lifts the discarded tchotchkes and jewelry off the side tables of her well-heeled clients. Where no one will think to ask if Jane is her real name.But heMeet Jane. Newly arrived to Birmingham, Alabama, Jane is a broke dog-walker in Thornfield Estates––a gated community full of McMansions, shiny SUVs, and bored housewives. The kind of place where no one will notice if Jane lifts the discarded tchotchkes and jewelry off the side tables of her well-heeled clients. Where no one will think to ask if Jane is her real name.But her luck changes when she meets Eddie­ Rochester. Recently widowed, Eddie is Thornfield Estates’ most mysterious resident. His wife, Bea, drowned in a boating accident with her best friend, their bodies lost to the deep. Jane can’t help but see an opportunity in Eddie––not only is he rich, brooding, and handsome, he could also offer her the kind of protection she’s always yearned for. Yet as Jane and Eddie fall for each other, Jane is increasingly haunted by the legend of Bea, an ambitious beauty with a rags-to-riches origin story, who launched a wildly successful southern lifestyle brand. How can she, plain Jane, ever measure up? And can she win Eddie’s heart before her past––or his––catches up to her?"
    },
    {
        "book_name": "Project Hail Mary",
        "url": "https://www.goodreads.com/book/show/54493401-project-hail-mary",
        "author": "Andy Weir",
        "ratings": {
            "ratings_score": 4.54,
            "rating_count": 134602.0
        },
        "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission--and if he fails, humanity and the earth itself will perish.Except that right now, he doesn't know that. He can't even remember his own name, let alone the nature of his assignment or how to complete it.All he knows is that he's been asleep for a very, very long time. And he's just been awakened to find Ryland Grace is the sole survivor on a desperate, last-chance mission--and if he fails, humanity and the earth itself will perish.Except that right now, he doesn't know that. He can't even remember his own name, let alone the nature of his assignment or how to complete it.All he knows is that he's been asleep for a very, very long time. And he's just been awakened to find himself millions of miles from home, with nothing but two corpses for company.His crewmates dead, his memories fuzzily returning, he realizes that an impossible task now confronts him. Alone on this tiny ship that's been cobbled together by every government and space agency on the planet and hurled into the depths of space, it's up to him to conquer an extinction-level threat to our species.And thanks to an unexpected ally, he just might have a chance.Part scientific mystery, part dazzling interstellar journey,  is a tale of discovery, speculation, and survival to rival --while taking us to places it never dreamed of going."
    },
    {
        "book_name": "The Push",
        "url": "https://www.goodreads.com/book/show/52476830-the-push",
        "author": "Ashley Audrain",
        "ratings": {
            "ratings_score": 4.13,
            "rating_count": 120431.0
        },
        "description": "Blythe Connor is determined that she will be the warm, comforting mother to her new baby Violet that she herself never had.But in the thick of motherhood’s exhausting early days, BlytheBlythe Connor is determined that she will be the warm, comforting mother to her new baby Violet that she herself never had.But in the thick of motherhood’s exhausting early days, Blythe becomes convinced that something is wrong with her daughter–she doesn’t behave like most children do.Or is it all in Blythe’s head? Her husband, Fox, says she’s imagining things. The more Fox dismisses her fears, the more Blythe begins to question her own sanity, and the more we begin to question what Blythe is telling us about her life as well.Then their son Sam is born–and with him, Blythe has the blissful connection she’d always imagined with her child. Even Violet seems to love her little brother. But when life as they know it is changed in an instant, the devastating fall-out forces Blythe to face the truth. is a tour de force you will read in a sitting, an utterly immersive novel that will challenge everything you think you know about motherhood, about what we owe our children, and what it feels like when women are not believed."
    },
    {
        "book_name": "The Last Thing He Told Me",
        "url": "https://www.goodreads.com/book/show/54981009-the-last-thing-he-told-me",
        "author": "Laura DaveLaura Dave",
        "ratings": {
            "ratings_score": 3.97,
            "rating_count": 202311.0
        },
        "description": "Despite her confusion and fear, Hannah Hall knows exactly to whom the note refers: Owen’s sixteen-year-old daughter, Bailey. Bailey, who lost her mother tragically as a child. Bailey, who wants absolutely nothing to do with her new stDespite her confusion and fear, Hannah Hall knows exactly to whom the note refers: Owen’s sixteen-year-old daughter, Bailey. Bailey, who lost her mother tragically as a child. Bailey, who wants absolutely nothing to do with her new stepmother.As Hannah’s increasingly desperate calls to Owen go unanswered; as the FBI arrests Owen’s boss; as a US Marshal and FBI agents arrive at her Sausalito home unannounced, Hannah quickly realizes her husband isn’t who he said he was. And that Bailey just may hold the key to figuring out Owen’s true identity—and why he really disappeared.Hannah and Bailey set out to discover the truth, together. But as they start putting together the pieces of Owen’s past, they soon realize they are also building a new future. One neither Hannah nor Bailey could have anticipated."
    },
    {
        "book_name": "The Four Winds",
        "url": "https://www.goodreads.com/book/show/53138081-the-four-winds",
        "author": "Kristin Hannah",
        "ratings": {
            "ratings_score": 4.32,
            "rating_count": 279487.0
        },
        "description": "Texas, 1934. Millions are out of work and a drought has broken the Great Plains. Farmers are fighting to keep their land and their livelihoods as the crops are failing, the water is drying up, and dust threatens to bury them all. One of the darkest periods of the Great Depression, the Dust Bowl era, has arrived with a vengeance.  In this uncertain and dangerous time, Elsa Texas, 1934. Millions are out of work and a drought has broken the Great Plains. Farmers are fighting to keep their land and their livelihoods as the crops are failing, the water is drying up, and dust threatens to bury them all. One of the darkest periods of the Great Depression, the Dust Bowl era, has arrived with a vengeance.  In this uncertain and dangerous time, Elsa Martinelli—like so many of her neighbors—must make an agonizing choice: fight for the land she loves or go west, to California, in search of a better life.  is an indelible portrait of America and the American Dream, as seen through the eyes of one indomitable woman whose courage and sacrifice will come to define a generation."
    },
    {
        "book_name": "The Love Hypothesis",
        "url": "https://www.goodreads.com/book/show/56732449-the-love-hypothesis",
        "author": "Ali HazelwoodAli Hazelwood",
        "ratings": {
            "ratings_score": 4.47,
            "rating_count": 69715.0
        },
        "description": "As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships--but her best friend does, and that's what got her into this situation. Convincing Anh that Olive is dating and well on her way to a happily ever after was always going to take more than hand-wavy Jedi mind tricks: Scientists require proof. So, like any self-respecting biologist,As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships--but her best friend does, and that's what got her into this situation. Convincing Anh that Olive is dating and well on her way to a happily ever after was always going to take more than hand-wavy Jedi mind tricks: Scientists require proof. So, like any self-respecting biologist, Olive panics and kisses the first man she sees.That man is none other than Adam Carlsen, a young hotshot professor--and well-known ass. Which is why Olive is positively floored when Stanford's reigning lab tyrant agrees to keep her charade a secret and be her fake boyfriend. But when a big science conference goes haywire, putting Olive's career on the Bunsen burner, Adam surprises her again with his unyielding support and even more unyielding...six-pack abs.Suddenly their little experiment feels dangerously close to combustion. And Olive discovers that the only thing more complicated than a hypothesis on love is putting her own heart under the microscope."
    },
    {
        "book_name": "Malibu Rising",
        "url": "https://www.goodreads.com/book/show/55404546-malibu-rising",
        "author": "Taylor Jenkins ReidTaylor Jenkins Reid",
        "ratings": {
            "ratings_score": 4.12,
            "rating_count": 216311.0
        },
        "description": " Malibu: August, 1983. It’s the day of Nina Riva’s annual end-of-summer party, and anticipation is at a fever pitch. Everyone wants to be around the famous Rivas: Nina, the talented surfer and supermodel; brothers Jay and Hu Malibu: August, 1983. It’s the day of Nina Riva’s annual end-of-summer party, and anticipation is at a fever pitch. Everyone wants to be around the famous Rivas: Nina, the talented surfer and supermodel; brothers Jay and Hud, one a championship surfer, the other a renowned photographer; and their adored baby sister, Kit. Together, the siblings are a source of fascination in Malibu and the world over—especially as the offspring of the legendary singer, Mick Riva.The only person not looking forward to the party of the year is Nina herself, who never wanted to be the center of attention, and who has also just been very publicly abandoned by her pro tennis player husband. Oh, and maybe Hud—because it is long past time to confess something to the brother from whom he’s been inseparable since birth.Jay, on the other hand, is counting the minutes until nightfall, when the girl he can’t stop thinking about promised she’ll be there.And Kit has a couple secrets of her own—including a guest she invited without consulting anyone.By midnight the party will be completely out of control. By morning, the Riva mansion will have gone up in flames. But before that first spark in the early hours before dawn, the alcohol will flow, the music will play, and the loves and secrets that shaped this family’s generations will all come bubbling to the surface. is a story about one unforgettable night in the life of a family: the night they each have to choose what they will keep from the people who made them... and what they will leave behind."
    },
    {
        "book_name": "Apples Never Fall",
        "url": "https://www.goodreads.com/book/show/56143578-apples-never-fall",
        "author": "Liane Moriarty",
        "ratings": {
            "ratings_score": 3.99,
            "rating_count": 41696.0
        },
        "description": "If your mother was missing, would you tell the police? Even if the most obvious suspect was your father?ThiIf your mother was missing, would you tell the police? Even if the most obvious suspect was your father?This is the dilemma facing the four grown Delaney siblings.The Delaneys are fixtures in their community. The parents, Stan and Joy, are the envy of all of their friends. They’re killers on the tennis court, and off it their chemistry is palpable. But after fifty years of marriage, they’ve finally sold their famed tennis academy and are ready to start what should be the golden years of their lives. So why are Stan and Joy so miserable?The four Delaney children—Amy, Logan, Troy, and Brooke—were tennis stars in their own right, yet as their father will tell you, none of them had what it took to go all the way. But that’s okay, now that they’re all successful grown-ups and there is the wonderful possibility of grandchildren on the horizon.One night a stranger named Savannah knocks on Stan and Joy’s door, bleeding after a fight with her boyfriend. The Delaneys are more than happy to give her the small kindness she sorely needs. If only that was all she wanted.Later, when Joy goes missing, and Savannah is nowhere to be found, the police question the one person who remains: Stan. But for someone who claims to be innocent, he, like many spouses, seems to have a lot to hide. Two of the Delaney children think their father is innocent, two are not so sure—but as the two sides square off against each other in perhaps their biggest match ever, all of the Delaneys will start to reexamine their shared family history in a very new light."
    },
    {
        "book_name": "The Spanish Love Deception",
        "url": "https://www.goodreads.com/book/show/54189398-the-spanish-love-deception",
        "author": "Elena  Armas",
        "ratings": {
            "ratings_score": 4.21,
            "rating_count": 73679.0
        },
        "description": "That would certainly be tomorroThat would certainly be tomorrow’s headline in the local newspaper of the small Spanish town I came from. Or the epitaph on my tombstone, seeing the turn my life had taken in the span of a phone call. Four weeks wasn’t a lot of time to find someone willing to cross the Atlantic–from NYC and all the way to Spain–for a wedding. Let alone, someone eager to play along my charade. But that didn’t mean I was desperate enough to bring the 6’4 blue eyed pain in my ass standing before me.  The man whose main occupation was making my blood boil had just offered himself to be my date. Right after inserting his nose in my business, calling me delusional, and calling himself my best option. See? Outrageous. Aggravating. Blood boiling. And much to my total despair, also right. Which left me with a surly and extra large dilemma in my hands. Was it worth the suffering to bring my colleague and bane of my existence as my fake boyfriend to my sister’s wedding? Or was I better off coming clean and facing the consequences of my panic induced lie?Like my  would say, ."
    },
    {
        "book_name": "The Paris Library",
        "url": "https://www.goodreads.com/book/show/52761909-the-paris-library",
        "author": "Janet Skeslien Charles",
        "ratings": {
            "ratings_score": 4.09,
            "rating_count": 44964.0
        },
        "description": "Paris, 1939: Young and ambitious Odile Souchet has it all: her handsome police officer beau and a dream job atParis, 1939: Young and ambitious Odile Souchet has it all: her handsome police officer beau and a dream job at the American Library in Paris. When the Nazis march into Paris, Odile stands to lose everything she holds dear, including her beloved library. Together with her fellow librarians, Odile joins the Resistance with the best weapons she has: books. But when the war finally ends, instead of freedom, Odile tastes the bitter sting of unspeakable betrayal. Montana, 1983: Lily is a lonely teenager looking for adventure in small-town Montana. Her interest is piqued by her solitary, elderly neighbor. As Lily uncovers more about her neighbor’s mysterious past, she finds that they share a love of language, the same longings, and the same intense jealousy, never suspecting that a dark secret from the past connects them. A powerful novel that explores the consequences of our choices and the relationships that make us who we are—family, friends, and favorite authors— shows that extraordinary heroism can sometimes be found in the quietest of places."
    },
    {
        "book_name": "The Sanatorium",
        "url": "https://www.goodreads.com/book/show/56935099-the-sanatorium",
        "author": "Sarah  Pearse",
        "ratings": {
            "ratings_score": 3.42,
            "rating_count": 75232.0
        },
        "description": "Half-hidden by forest and overshadowed by threatening peaks, Le Sommet has always been a sinister place. Long plagued by troubling rumors, the former abandoned sanatorium has since been renovated into a five-star minimalist hotel.An imposing, isolated getaway spot high up in the Swiss Alps is the last place Elin Warner wants to Half-hidden by forest and overshadowed by threatening peaks, Le Sommet has always been a sinister place. Long plagued by troubling rumors, the former abandoned sanatorium has since been renovated into a five-star minimalist hotel.An imposing, isolated getaway spot high up in the Swiss Alps is the last place Elin Warner wants to be. But Elin’s taken time off from her job as a detective, so when her estranged brother, Isaac, and his fiancée, Laure, invite her to celebrate their engagement at the hotel, Elin really has no reason not to accept.Arriving in the midst of a threatening storm, Elin immediately feels on edge–there’s something about the hotel that makes her nervous. And when they wake the following morning to discover Laure is missing, Elin must trust her instincts if they hope to find her. With the storm closing off all access to the hotel, the longer Laure stays missing, the more the remaining guests start to panic.Elin is under pressure to find Laure, but no one has realized yet that another woman has gone missing. And she’s the only one who could have warned them just how much danger they are all in. . ."
    },
    {
        "book_name": "The Soulmate Equation",
        "url": "https://www.goodreads.com/book/show/55692620-the-soulmate-equation",
        "author": "Christina Lauren",
        "ratings": {
            "ratings_score": 4.07,
            "rating_count": 45492.0
        },
        "description": "Single mom Jess Davis is a data and statistics wizard, but no amount of number crunching can convince her to step back into the dating world. Raised by her grandparents--who now help raise her seven-year-old daughter, Juno--Jess has been left behind too often to feel comfortable letting anyone in. After all, her father's never been around, her hard-partying mother disappeaSingle mom Jess Davis is a data and statistics wizard, but no amount of number crunching can convince her to step back into the dating world. Raised by her grandparents--who now help raise her seven-year-old daughter, Juno--Jess has been left behind too often to feel comfortable letting anyone in. After all, her father's never been around, her hard-partying mother disappeared when she was six, and her ex decided he wasn't \"father material\" before Juno was even born. Jess holds her loved ones close, but working constantly to stay afloat is hard...and lonely.But then Jess hears about GeneticAlly, a buzzy new DNA-based matchmaking company that's predicted to change dating forever. Finding a soulmate through DNA? The reliability of numbers:  Jess understands. At least she thought she did, until her test shows an unheard-of 98% compatibility with another subject in the database: GeneticAlly's founder, Dr. River Pena. This is one number she can't wrap her head around, because she already knows Dr. Pena. The stuck-up, stubborn man is without a doubt  her soulmate. But GeneticAlly has a proposition: Get to know him and we'll pay you. Jess--who is barely making ends meet--is in no position to turn it down, despite her skepticism about the project and her dislike for River. As the pair are dragged from one event to the next as the \"Diamond\" pairing that could make GeneticAlly a mint in stock prices, Jess begins to realize that there might be more to the scientist--and the science behind a soulmate--than she thought."
    },
    {
        "book_name": "The Paper Palace",
        "url": "https://www.goodreads.com/book/show/55994372-the-paper-palace",
        "author": "Miranda Cowley Heller",
        "ratings": {
            "ratings_score": 3.94,
            "rating_count": 52550.0
        },
        "description": "It is a perfect July morning, and Elle, a fifty-year-old happily married mother of three, awakens at \"The Paper Palace\"--the family summer place which she has visited every summer of her life. But this morning is different: last night Elle and her oldest friend Jonas crept out the back door into the darkness and had sex wiIt is a perfect July morning, and Elle, a fifty-year-old happily married mother of three, awakens at \"The Paper Palace\"--the family summer place which she has visited every summer of her life. But this morning is different: last night Elle and her oldest friend Jonas crept out the back door into the darkness and had sex with each other for the first time, all while their spouses chatted away inside. Now, over the next twenty-four hours, Elle will have to decide between the life she has made with her genuinely beloved husband, Peter, and the life she always imagined she would have had with her childhood love, Jonas, if a tragic event hadn't forever changed the course of their lives. As Heller colors in the experiences that have led Elle to this day, we arrive at her ultimate decision with all its complexity. Tender yet devastating,  considers the tensions between desire and dignity, the legacies of abuse, and the crimes and misdemeanors of families."
    },
    {
        "book_name": "It Happened One Summer",
        "url": "https://www.goodreads.com/book/show/55659629-it-happened-one-summer",
        "author": "Tessa Bailey",
        "ratings": {
            "ratings_score": 4.15,
            "rating_count": 37963.0
        },
        "description": "Piper Bellinger is fashionable, influential, and her reputation as a wild child means the paparazzi are constantly on her heels. When too much champagne and an out-of-control rooftop party lands Piper in the slammer, her stepfather decides enough is enough. So he cuts her off, and sends Piper and her sister to learn some responsibility running their late father’s dive bar.Piper Bellinger is fashionable, influential, and her reputation as a wild child means the paparazzi are constantly on her heels. When too much champagne and an out-of-control rooftop party lands Piper in the slammer, her stepfather decides enough is enough. So he cuts her off, and sends Piper and her sister to learn some responsibility running their late father’s dive bar... in Washington.Piper hasn’t even been in Westport for five minutes when she meets big, bearded sea captain Brendan, who thinks she won’t last a week outside of Beverly Hills. So what if Piper can’t do math, and the idea of sleeping in a shabby apartment with bunk beds gives her hives. How bad could it really be? She’s determined to show her stepfather—and the hot, grumpy local—that she’s more than a pretty face.Except it’s a  town and everywhere she turns, she bumps into Brendan. The fun-loving socialite and the gruff fisherman are polar opposites, but there’s an undeniable attraction simmering between them. Piper doesn’t want any distractions, especially feelings for a man who sails off into the sunset for weeks at a time. Yet as she reconnects with her past and begins to feel at home in Westport, Piper starts to wonder if the cold, glamorous life she knew is what she truly wants. LA is calling her name, but Brendan—and this town full of memories—may have already caught her heart. "
    },
    {
        "book_name": "Lore",
        "url": "https://www.goodreads.com/book/show/53375824-lore",
        "author": "Alexandra Bracken",
        "ratings": {
            "ratings_score": 3.85,
            "rating_count": 35040.0
        },
        "description": "Every seven years, the Agon begins. As punishment for a past rebellion, nine Greek gods are forced to walk the earth as mortals, hunted by the descendants of ancient bloodlines, all eager to kill a god and seize their divEvery seven years, the Agon begins. As punishment for a past rebellion, nine Greek gods are forced to walk the earth as mortals, hunted by the descendants of ancient bloodlines, all eager to kill a god and seize their divine power and immortality.Long ago, Lore Perseous fled that brutal world in the wake of her family's sadistic murder by a rival line, turning her back on the hunt's promises of eternal glory. For years she's pushed away any thought of revenge against the man--now a god--responsible for their deaths.Yet as the next hunt dawns over New York City, two participants seek out her help: Castor, a childhood friend of Lore believed long dead, and a gravely wounded Athena, among the last of the original gods.The goddess offers an alliance against their mutual enemy and, at last, a way for Lore to leave the Agon behind forever. But Lore's decision to bind her fate to Athena's and rejoin the hunt will come at a deadly cost--and still may not be enough to stop the rise of a new god with the power to bring humanity to its knees."
    },
    {
        "book_name": "Rule of Wolves",
        "url": "https://www.goodreads.com/book/show/36307674-rule-of-wolves",
        "author": "Leigh Bardugo",
        "ratings": {
            "ratings_score": 4.41,
            "rating_count": 59499.0
        },
        "description": "The Grishaverse will be coming to Netflix soon with Shadow and Bone, an original series! As Fjerda's massive army prepares to invade, Nikolai Lantsov will summon every bit of his ingenuity and chThe Grishaverse will be coming to Netflix soon with Shadow and Bone, an original series! As Fjerda's massive army prepares to invade, Nikolai Lantsov will summon every bit of his ingenuity and charm—and even the monster within—to win this fight. But a dark threat looms that cannot be defeated by a young king's gift for the impossible.  Zoya Nazyalensky has lost too much to war. She saw her mentor die and her worst enemy resurrected, and she refuses to bury another friend. Now duty demands she embrace her powers to become the weapon her country needs. No matter the cost. Deep undercover, Nina Zenik risks discovery and death as she wages war on Fjerda from inside its capital. But her desire for revenge may cost her country its chance at freedom and Nina the chance to heal her grieving heart. Together they must find a way to forge a future in the darkness. Or watch a nation fall."
    },
    {
        "book_name": "Survive the Night",
        "url": "https://www.goodreads.com/book/show/55628983-survive-the-night",
        "author": "Riley Sager",
        "ratings": {
            "ratings_score": 3.54,
            "rating_count": 41097.0
        },
        "description": "Josh Baxter, the man behind the wheel, is a virtual stranger to Charlie. They met at the campus ride board, each looking to share the long drive home to Ohio. Both have good reasons foJosh Baxter, the man behind the wheel, is a virtual stranger to Charlie. They met at the campus ride board, each looking to share the long drive home to Ohio. Both have good reasons for wanting to get away. For Charlie, it's guilt and grief over the murder of her best friend, who became the third victim of the man known as the Campus Killer. For Josh, it's to help care for his sick father. Or so he says. Like the Hitchcock heroine she's named after, Charlie has her doubts. There's something suspicious about Josh, from the holes in his story about his father to how he doesn't seem to want Charlie to see inside the car's trunk. As they travel an empty highway in the dead of night, an increasingly worried Charlie begins to think she's sharing a car with the Campus Killer. Is Josh truly dangerous? Or is Charlie's suspicion merely a figment of her movie-fueled imagination?What follows is a game of cat-and-mouse played out on night-shrouded roads and in neon-lit parking lots, during an age when the only call for help can be made on a pay phone and in a place where there's nowhere to run. In order to win, Charlie must do one thing--survive the night."
    },
    {
        "book_name": "Crying in H Mart",
        "url": "https://www.goodreads.com/book/show/54814676-crying-in-h-mart",
        "author": "Michelle Zauner",
        "ratings": {
            "ratings_score": 4.36,
            "rating_count": 49708.0
        },
        "description": "An unflinching, powerful memoir about growing up Korean American, losing her mother, and forging her own identity.In this exquisite story of family, food, grief, and endurance, Michelle Zauner proves herself far more than a dazzling singer, songwriter, and guitarist. With humor and heart, she tells of growing up one of the few Asian American kids at her school in Eugene, OAn unflinching, powerful memoir about growing up Korean American, losing her mother, and forging her own identity.In this exquisite story of family, food, grief, and endurance, Michelle Zauner proves herself far more than a dazzling singer, songwriter, and guitarist. With humor and heart, she tells of growing up one of the few Asian American kids at her school in Eugene, Oregon; of struggling with her mother's particular, high expectations of her; of a painful adolescence; of treasured months spent in her grandmother's tiny apartment in Seoul, where she and her mother would bond, late at night, over heaping plates of food. As she grew up, moving to the East Coast for college, finding work in the restaurant industry, and performing gigs with her fledgling band--and meeting the man who would become her husband--her Koreanness began to feel ever more distant, even as she found the life she wanted to live. It was her mother's diagnosis of terminal cancer, when Michelle was twenty-five, that forced a reckoning with her identity and brought her to reclaim the gifts of taste, language, and history her mother had given her.Vivacious and plainspoken, lyrical and honest, Zauner's voice is as radiantly alive on the page as it is onstage. Rich with intimate anecdotes that will resonate widely, and complete with family photos,  is a book to cherish, share, and reread."
    },
    {
        "book_name": "The Good Sister",
        "url": "https://www.goodreads.com/book/show/53137974-the-good-sister",
        "author": "Sally Hepworth",
        "ratings": {
            "ratings_score": 4.19,
            "rating_count": 54899.0
        },
        "description": "There's only been one time that Rose couldn't stop me from doing the wrong thing and that was a mistake that will haunt me for the rest of my life.Fern Castle works in her local library. She has dinner with her twin sister Rose three nightThere's only been one time that Rose couldn't stop me from doing the wrong thing and that was a mistake that will haunt me for the rest of my life.Fern Castle works in her local library. She has dinner with her twin sister Rose three nights a week. And she avoids crowds, bright lights and loud noises as much as possible. Fern has a carefully structured life and disrupting her routine can be...dangerous.When Rose discovers that she cannot get pregnant, Fern sees her chance to pay her sister back for everything Rose has done for her. Fern can have a baby for Rose. She just needs to find a father. Simple.Fern's mission will shake the foundations of the life she has carefully built for herself and stir up dark secrets from the past, in this quirky, rich and shocking story of what families keep hidden."
    },
    {
        "book_name": "The ​Crown of Gilded Bones",
        "url": "https://www.goodreads.com/book/show/55240343-the-crown-of-gilded-bones",
        "author": "Jennifer L. Armentrout",
        "ratings": {
            "ratings_score": 4.25,
            "rating_count": 82308.0
        },
        "description": "Poppy never dreamed she would find the love she’s found with Prince Casteel. She wants to revel in her happiness but first they must free his brother and find hers. It’s a dangerous mission and one with far-reaching consequences neither dreamed of. Because Poppy is the Chosen, the Blessed. The true ruler of Atlantia. She carries the bPoppy never dreamed she would find the love she’s found with Prince Casteel. She wants to revel in her happiness but first they must free his brother and find hers. It’s a dangerous mission and one with far-reaching consequences neither dreamed of. Because Poppy is the Chosen, the Blessed. The true ruler of Atlantia. She carries the blood of the King of Gods within her. By right the crown and the kingdom are hers.Poppy has only ever wanted to control her own life, not the lives of others, but now she must choose to either forsake her birthright or seize the gilded crown and become the Queen of Flesh and Fire. But as the kingdoms’ dark sins and blood-drenched secrets finally unravel, a long-forgotten power rises to pose a genuine threat. And they will stop at nothing to ensure that the crown never sits upon Poppy’s head.But the greatest threat to them and to Atlantia is what awaits in the far west, where the Queen of Blood and Ash has her own plans, ones she has waited hundreds of years to carry out. Poppy and Casteel must consider the impossible—travel to the Lands of the Gods and wake the King himself. And as shocking secrets and the harshest betrayals come to light, and enemies emerge to threaten everything Poppy and Casteel have fought for, they will discover just how far they are willing to go for their people—and each other."
    },
    {
        "book_name": "The Other Black Girl",
        "url": "https://www.goodreads.com/book/show/55711688-the-other-black-girl",
        "author": "Zakiya Dalila Harris",
        "ratings": {
            "ratings_score": 3.46,
            "rating_count": 32067.0
        },
        "description": "Twenty-six-year-old editorial assistant Nella Rogers is tired of being the only Black employee at Wagner Books. Fed up with the isolation and microaggressions, she’s thrilled when Twenty-six-year-old editorial assistant Nella Rogers is tired of being the only Black employee at Wagner Books. Fed up with the isolation and microaggressions, she’s thrilled when Harlem-born and bred Hazel starts working in the cubicle beside hers. They’ve only just started comparing natural hair care regimens, though, when a string of uncomfortable events elevates Hazel to Office Darling, and Nella is left in the dust.Then the notes begin to appear on Nella’s desk: LEAVE WAGNER. NOW.It’s hard to believe Hazel is behind these hostile messages. But as Nella starts to spiral and obsess over the sinister forces at play, she soon realizes that there’s a lot more at stake than just her career.A whip-smart and dynamic thriller and sly social commentary that is perfect for anyone who has ever felt manipulated, threatened, or overlooked in the workplace,  will keep you on the edge of your seat until the very last twist."
    },
    {
        "book_name": "Firekeeper's Daughter",
        "url": "https://www.goodreads.com/book/show/52346471-firekeeper-s-daughter",
        "author": "Angeline Boulley",
        "ratings": {
            "ratings_score": 4.41,
            "rating_count": 33189.0
        },
        "description": "As a biracial, unenrolled tribal member and the product of a scandal, eighteen-year-old Daunis Fontaine has never quite fit in, both in her hometown and on the nearby Ojibwe reservation. Daunis dreams of studying medicine, but when her family is struck by tragedy, she puts her future on hold to care for her fragile mother. The only bright spot is meeting Jamie, the charminAs a biracial, unenrolled tribal member and the product of a scandal, eighteen-year-old Daunis Fontaine has never quite fit in, both in her hometown and on the nearby Ojibwe reservation. Daunis dreams of studying medicine, but when her family is struck by tragedy, she puts her future on hold to care for her fragile mother. The only bright spot is meeting Jamie, the charming new recruit on her brother Levi’s hockey team. Yet even as Daunis falls for Jamie, certain details don’t add up and she senses the dashing hockey star is hiding something. Everything comes to light when Daunis witnesses a shocking murder, thrusting her into the heart of a criminal investigation. Reluctantly, Daunis agrees to go undercover, but secretly pursues her own investigation, tracking down the criminals with her knowledge of chemistry and traditional medicine. But the deceptions—and deaths—keep piling up and soon the threat strikes too close to home. Now, Daunis must learn what it means to be a strong Anishinaabe kwe (Ojibwe woman) and how far she'll go to protect her community, even if it tears apart the only world she’s ever known. "
    },
    {
        "book_name": "The Rose Code",
        "url": "https://www.goodreads.com/book/show/53914938-the-rose-code",
        "author": "Kate Quinn",
        "ratings": {
            "ratings_score": 4.48,
            "rating_count": 68050.0
        },
        "description": "1940. As England prepares to fight the Nazis, three very different women answer the call to mysterious country estate Bletchley Park, where the best minds in Britain train to break German military codes. Vivacious debutante Osla is the girl who has everything—beauty, wealth, and the dashing Prince Philip of Greece sending her roses—but she burns to prove herself as more th1940. As England prepares to fight the Nazis, three very different women answer the call to mysterious country estate Bletchley Park, where the best minds in Britain train to break German military codes. Vivacious debutante Osla is the girl who has everything—beauty, wealth, and the dashing Prince Philip of Greece sending her roses—but she burns to prove herself as more than a society girl, and puts her fluent German to use as a translator of decoded enemy secrets. Imperious self-made Mab, product of east-end London poverty, works the legendary codebreaking machines as she conceals old wounds and looks for a socially advantageous husband. Both Osla and Mab are quick to see the potential in local village spinster Beth, whose shyness conceals a brilliant facility with puzzles, and soon Beth spreads her wings as one of the Park’s few female cryptanalysts. But war, loss, and the impossible pressure of secrecy will tear the three apart. 1947. As the royal wedding of Princess Elizabeth and Prince Philip whips post-war Britain into a fever, three friends-turned-enemies are reunited by a mysterious encrypted letter--the key to which lies buried in the long-ago betrayal that destroyed their friendship and left one of them confined to an asylum. A mysterious traitor has emerged from the shadows of their Bletchley Park past, and now Osla, Mab, and Beth must resurrect their old alliance and crack one last code together. But each petal they remove from the rose code brings danger--and their true enemy--closer..."
    }
]